fa-xbrl/src/Catalogs/velpo_ItemLinks/velpo_ItemLinks.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>velpo_ItemLinks</name>
  <owners>ChartOfCharacteristicTypes.velpo_SourceQueryComponents</owners>
  <attributes>
    <name>LinkType</name>
    <type>
      <types>EnumRef.velpo_ItemLinkTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Account</name>
    <type>
      <types>ChartOfAccountsRef.velpo_Economic</types>
    </type>
  </attributes>
  <attributes>
    <name>Attribute</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.velpo_ObjectAttributes</types>
    </type>
  </attributes>
  <attributes>
    <name>Comments</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Dimension</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.velpo_DimensionIDTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Result</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.velpo_SourceQueryComponents</types>
    </type>
  </attributes>
  <attributes>
    <name>TableType</name>
    <type>
      <types>EnumRef.velpo_ItemTableTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>UseSourceValue</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AttributeLinks</name>
    <attributes>
      <name>Otherwise</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>FieldValue</name>
      <type>
        <types>Characteristic.velpo_SourceQueryComponents</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.velpo_ObjectAttributes</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>DimensionLinks</name>
    <attributes>
      <name>Otherwise</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>FieldValue</name>
      <type>
        <types>Characteristic.velpo_SourceQueryComponents</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.velpo_DimensionIDTypes</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

fa-xbrl/src/Enums/velpo_ItemLinkTypes/velpo_ItemLinkTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>velpo_ItemLinkTypes</name>
  <enumValues>
    <name>Dimension</name>
  </enumValues>
  <enumValues>
    <name>Attribute</name>
  </enumValues>
</mdclass:Enum>

fa-xbrl/src/Catalogs/velpo_ItemLinks/Forms/ItemForm/Module.bsl
&AtServer
Procedure AutofilAtServer(ItemName)
	
	// import
	Common = velpo_CommonFunctions;
	
	ItemValueType = Common.ObjectAttributeValue(Object[ItemName], "ValueType");
	FieldValueType = velpo_CommonFunctions.ObjectAttributeValue(Object.Owner, "ValueType");
	TabularSection = Object[ItemName + "Links"];
	
	TypesArray = ItemValueType.Types();
	For Each Type In TypesArray  Do
		If Enums.AllRefsType().ContainsType(Type) Then
			Value = Undefined;
			Value = ItemValueType.AdjustValue(Value);
			MetadataValue = Value.Metadata();
			For Each EnumValue  In MetadataValue.EnumValues Do
			 	LinksLine = TabularSection.Add();
				Value = Enums[MetadataValue.Name][EnumValue.Name];
				LinksLine.FieldValue  = FieldValueType.AdjustValue(Value);
				LinksLine.Value  = Value;
			EndDo; 
		EndIf;
	EndDo; 
	
	Object.UseSourceValue = False;
				
EndProcedure


&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	// import
	Common = velpo_CommonFunctions;
	ItemLinkTypes = Enums.velpo_ItemLinkTypes;
	
	If Object.Ref.IsEmpty() Then
		
		FillPropertyValues(Object, Parameters, "Owner,Account,TableType");
		Object.Result = Common.ObjectAttributeValue(Object.Owner, "Parent");
	
		If TypeOf(Parameters.Property) = Type("ChartOfCharacteristicTypesRef.velpo_DimensionIDTypes") Then
			Object.Dimension = Parameters.Property;
			Object.LinkType = ItemLinkTypes.Dimension;
		Else
			Object.Attribute = Parameters.Property;
			Object.LinkType = ItemLinkTypes.Attribute;
		EndIf;
		
	EndIf;	
	
EndProcedure

&AtClient
Procedure AfterWrite(WriteParameters)
	
	NotifyChanged(Object.Ref);
	
EndProcedure

&AtClient
Procedure ListOnEditEnd(Item, NewRow, CancelEdit)

	Object.UseSourceValue = False;
	
EndProcedure

&AtClient
Procedure AttributeLinksAutofill(Command)
	
	AutofilAtServer("Attribute");
	
EndProcedure

&AtClient
Procedure DimensionLinksAutofill(Command)
	
	AutofilAtServer("Dimension");
	
EndProcedure
